DesignPatterns_Exercicios/Exercicio2_AbstractFactory/uml.dot
digraph G { rankdir=LR; node [shape=box]; DF[label="<<interface>> DocumentoFiscal"]; PG[label="<<interface>> Pagamento"]; ET[label="<<interface>> EtiquetaEnvio"]; F[label="<<interface>> FabricaCheckout\n+ criarDocumentoFiscal()\n+ criarPagamento()\n+ criarEtiqueta()"]; N[label="NotaFiscalBrasil"]; S[label="SalesInvoice"]; V[label="VatInvoice"]; P[label="PixBrasil"]; B[label="BoletoBrasil"]; C[label="CartaoEua"]; SE[label="Sepa"]; CO[label="CorreiosBrasil"]; U[label="Usps"]; DP[label="DeutschePost"]; FB[label="FabricaBrasil"]; FE[label="FabricaEua"]; FA[label="FabricaAlemanha"]; CH[label="Checkout\nfinalizar(FabricaCheckout,...)"]; X[label="SeletorFabrica"]; N->DF[dir=back]; S->DF[dir=back]; V->DF[dir=back]; P->PG[dir=back]; B->PG[dir=back]; C->PG[dir=back]; SE->PG[dir=back]; CO->ET[dir=back]; U->ET[dir=back]; DP->ET[dir=back]; FB->F[dir=back]; FE->F[dir=back]; FA->F[dir=back]; FB->N; FB->P; FB->CO; FE->S; FE->C; FE->U; FA->V; FA->SE; FA->DP; CH->F; X->F; }
